ckcd1hp/First-Test-ESP32/src/main.cpp
    // update web page every minute
    if (rtc.getSecond() == 0)
    {
      if (!pump1StatusUpdated and pump1OverrideTimeEpochEnd != 0)
      {
        // Send Events to the Web Client with the Sensor Readings
        String command = (pump1Command) ? "On " : "Off ";
        String timeLeft = command + "(Override " + String((pump1OverrideTimeEpochEnd - rtc.getEpoch()) / 60) + " min)";
        events.send(timeLeft.c_str(), "pump1Command", millis());
        pump1StatusUpdated = true;
      }
    }
    else
      pump1StatusUpdated = false;
    // if pump1OverrideTimeEpochEnd is 0 and pump is in override, then override is permanent
    if (rtc.getEpoch() >= pump1OverrideTimeEpochEnd and pump1OverrideTimeEpochEnd != 0)
    {
      setPumpAuto(WATER_PUMP_1_PIN);
    }
  }
  /* ----------------------------- WATER PUMP 2 -----------------------------------------*/
  if (!pump2Override)
  { // auto mode
    // Run water pump 2 from 12pm to 6pm continuously.  The other 12 hours, the pump will run for 1 min on the half hour
    if (currentHour >= 12 and currentHour < 18)
      digitalWrite(WATER_PUMP_2_PIN, HIGH);
    else if (currentMin == 30)
      digitalWrite(WATER_PUMP_2_PIN, HIGH);
    else
      digitalWrite(WATER_PUMP_2_PIN, LOW);
  }
  else
  { // pump in hand
    // pump2 is in override for set duration (set by user from webpage)

    // update web page every minute
    if (rtc.getSecond() == 0)
    {
      if (!pump2StatusUpdated and pump2OverrideTimeEpochEnd != 0)
      {
        // Send Events to the Web Client with the Sensor Readings
        String command = (pump2Command) ? "On " : "Off ";
        String timeLeft = command + "(Override " + String((pump2OverrideTimeEpochEnd - rtc.getEpoch()) / 60) + " min)";
        events.send(timeLeft.c_str(), "pump2Command", millis());
        pump2StatusUpdated = true;
      }
    }
    else
      pump2StatusUpdated = false;
    // if pump2OverrideTimeEpochEnd is 0 and pump is in override, then override is permanent
    if (rtc.getEpoch() >= pump2OverrideTimeEpochEnd and pump2OverrideTimeEpochEnd != 0)
    {
      setPumpAuto(WATER_PUMP_2_PIN);
    }
  }
}
void updatePumpStatuses()
{
  // Send Events to the Web Client with the pump statuses (every 10 seconds)
  String p1String = (pump1Status) ? "On " : "Off ";
  String p2String = (pump2Status) ? "On " : "Off ";
  String airPString = (airPumpStatus) ? "On " : "Off ";
  events.send(p1String.c_str(), "pump1Status", millis());
  events.send(p2String.c_str(), "pump2Status", millis());
  events.send(airPString.c_str(), "airPumpStatus", millis());
}
void checkPumpAlarms(int currentMin)
{
  if (pump1Command != pump1Status)
  {
    if (pump1AlarmTimeEpochEnd == 0)
    {
      // first instance of mismatch, start timer if not already in alarm
      if (!pump1Alarm)
      {
        pump1AlarmTimeEpochEnd = rtc.getEpoch() + 60; // 1 minute timer
      }
    }
    else
    {
      if (rtc.getEpoch() >= pump1AlarmTimeEpochEnd)
      {
        // set alarm
        pump1Alarm = true;
        pump1AlarmTimeEpochEnd = 0;
      }
    }
  }
  else
  {
    pump1Alarm = false;
  }
}
void getWaterLevel()
{
  // read ultrasonic sound sensor and output distance
  digitalWrite(ULTRASONIC_TRIG_PIN, LOW);
  delayMicroseconds(2);
  digitalWrite(ULTRASONIC_TRIG_PIN, HIGH);
  delayMicroseconds(10);
  digitalWrite(ULTRASONIC_TRIG_PIN, LOW);
  duration = pulseIn(ULTRASONIC_ECHO_PIN, HIGH);
  distanceCm = duration * SOUND_SPEED / 2;
  // print distance to serial monitor
  Serial.print("Distance: ");
  Serial.print(distanceCm);
  Serial.println(" cm");
  if (distanceCm > 20)
  {
    waterLevel = W_LOW;
  }
  else if (distanceCm > 10)
  {
    waterLevel = W_MED;
  }
  else
  {
    waterLevel = W_HIGH;
  }
  String waterLevelString = (waterLevel == W_LOW) ? "Low" : (waterLevel == W_MED) ? "Medium"
                                                                                  : "High";
  events.send(waterLevelString.c_str(), "waterLevel", millis());
}